SLS/src/InformationRegisters/УС_ОчередьПочта/УС_ОчередьПочта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УС_ОчередьПочта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КогдаОтправить</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресатДоставки</name>
    <comment>Email</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Копии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытыеКопии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысокаяВажность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОтправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПопыткиОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСохраняемогоФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправкаCDO</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветКому</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыОснований</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SLS/src/InformationRegisters/УС_ОчередьПочта/Forms/ФормаСписка/Module.bsl
//&НаСервере
//Процедура ОтправитьСейчасНаСервере()
//	// Вставить содержимое обработчика.
//КонецПроцедуры

&НаСервере
Процедура ПолучитьСодержимое(Знач ВыделенСтр)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УС_ОчередьПочта.Период КАК Период,
	|	УС_ОчередьПочта.Документ КАК Документ,
	|	УС_ОчередьПочта.УникальныйИдентификатор КАК УникальныйИдентификатор
	|ИЗ
	|	РегистрСведений.УС_ОчередьПочта КАК УС_ОчередьПочта
	|ГДЕ
	|	ЛОЖЬ";
	
	ВТ = Запрос.Выполнить().Выгрузить();
	ВТ.Очистить();

	Для каждого стр из ВыделенСтр Цикл
		НовСтр = ВТ.Добавить();
		НовСтр.Период = стр.Период;
		//НовСтр.Документ = стр.Документ;
		НовСтр.УникальныйИдентификатор = стр.УникальныйИдентификатор;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	// Романов 12/05/2022 dev-870 + ПутьКФайлу, ИмяСохраняемогоФайла, КоличествоПопытокОтправки, ДатаПопыткиОтправки
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ.Период КАК Период,
		|	ВТ.УникальныйИдентификатор КАК УникальныйИдентификатор
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УС_ОчередьПочта.Период КАК Период,
		|	УС_ОчередьПочта.Документ КАК Документ,
		|	УС_ОчередьПочта.Отправитель КАК Отправитель,
		|	УС_ОчередьПочта.КогдаОтправить КАК КогдаОтправить,
		|	УС_ОчередьПочта.АдресатДоставки КАК АдресатДоставки,
		|	УС_ОчередьПочта.Копии КАК Копии,
		|	УС_ОчередьПочта.СкрытыеКопии КАК СкрытыеКопии,
		|	УС_ОчередьПочта.Тема КАК Тема,
		|	УС_ОчередьПочта.Текст КАК Текст,
		|	УС_ОчередьПочта.Вложения КАК Вложения,
		|	УС_ОчередьПочта.Отправлено КАК Отправлено,
		|	УС_ОчередьПочта.ВысокаяВажность КАК ВысокаяВажность,
		|	УС_ОчередьПочта.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	УС_ОчередьПочта.ПредставлениеОтправителя КАК ПредставлениеОтправителя,
		|	УС_ОчередьПочта.ПутьКФайлу КАК ПутьКФайлу,
		|	УС_ОчередьПочта.ИмяСохраняемогоФайла КАК ИмяСохраняемогоФайла,
		|	УС_ОчередьПочта.КоличествоПопытокОтправки КАК КоличествоПопытокОтправки,
		|	УС_ОчередьПочта.ДатаПопыткиОтправки КАК ДатаПопыткиОтправки,
		|	УС_ОчередьПочта.ОтправкаCDO КАК ОтправкаCDO,
		|	УС_ОчередьПочта.ОтветКому КАК ОтветКому,
		|	УС_ОчередьПочта.ИдентификаторСообщения КАК ИдентификаторСообщения,
		|	УС_ОчередьПочта.ИдентификаторыОснований КАК ИдентификаторыОснований
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УС_ОчередьПочта КАК УС_ОчередьПочта
		|		ПО ВТ.Период = УС_ОчередьПочта.Период
		|			И ВТ.УникальныйИдентификатор = УС_ОчередьПочта.УникальныйИдентификатор";
	Запрос.УстановитьПараметр("ВТ",ВТ);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ОтправитьСейчасНаСервере(РезультатЗапроса);
	
КонецПроцедуры	

&НаСервере
Процедура ПолучитьСодержимоеДляУдаления(Знач ВыделенСтр)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УС_ОчередьПочта.Период,
		|	УС_ОчередьПочта.Документ,
		|	УС_ОчередьПочта.УникальныйИдентификатор
		|ИЗ
		|	РегистрСведений.УС_ОчередьПочта КАК УС_ОчередьПочта";
	
	ВТ = Запрос.Выполнить().Выгрузить();
	
	ВТ.Очистить();

	Для каждого стр из ВыделенСтр Цикл
		НовСтр = ВТ.Добавить();
		НовСтр.Период = стр.Период;
		НовСтр.Документ = стр.Документ;
		НовСтр.УникальныйИдентификатор = стр.УникальныйИдентификатор;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ВТ, "ТЗДляУдаления");
		
КонецПроцедуры	



&НаКлиенте
Процедура ОтправитьСейчас(Команда)
	
	ПолучитьСодержимое(Элементы.Список.ВыделенныеСтроки);

КонецПроцедуры

&НаСервере
Процедура ОтправитьСейчасНаСервере(Данные)
	
	РегистрыСведений.УС_ОчередьПочта.ОтправитьПисьма(Данные, Истина);
	
КонецПроцедуры	
&НаСервере
Функция ПолучитьХранилище(Струк)
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УС_ОчередьПочта.Вложения
		|ИЗ
		|	РегистрСведений.УС_ОчередьПочта КАК УС_ОчередьПочта
		|ГДЕ
		|	УС_ОчередьПочта.Период = &Период
		|	И УС_ОчередьПочта.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Струк.Документ);
	Запрос.УстановитьПараметр("Период", Струк.Период);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Вложения;
	КонецЕсли;
	
	Возврат Результат;	
	
	
КонецФункции

&НаКлиенте
Процедура ОтметитьВыбранноеКОтправке(Команда)
	//Элементы.Список.
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ОчиститьХранилищеВыбранныхПисемНаСервере(Струк)
	
	НаборЗаписей = РегистрыСведений.УС_ОчередьПочта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Струк.Период);
	НаборЗаписей.Отбор.Документ.Установить(Струк.Документ);
	НаборЗаписей.Отбор.УникальныйИдентификатор.Установить(Струк.УникальныйИдентификатор);
	НаборЗаписей.Прочитать();
	Для Каждого Строка Из НаборЗаписей Цикл
		Строка.Вложения = Новый ХранилищеЗначения(Неопределено); 	
	КонецЦикла;

	НаборЗаписей.Записать();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьХранилищеВыбранныхПисем(Команда)
	
	ТЗДляУдаления.Очистить();
	
	ПолучитьСодержимоеДляУдаления(Элементы.Список.ВыделенныеСтроки);
	
	КолВо = ТЗДляУдаления.Количество();
	Сч = 0;
	
	Для Каждого ВыделенСтр Из ТЗДляУдаления Цикл
		Струк = Новый Структура;
		Струк.Вставить("Период", ВыделенСтр.Период); 
		Струк.Вставить("Документ", ВыделенСтр.Документ); 
		Струк.Вставить("УникальныйИдентификатор", ВыделенСтр.УникальныйИдентификатор); 
	
		ОчиститьХранилищеВыбранныхПисемНаСервере(Струк);
		
		Сч = Сч + 1;
		Состояние("Очищено: "+Строка(Сч)+" / "+ Строка(КолВо));
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекстовкаHTML = "";
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовкаHTML = ТекстHTML(Элементы.Список.ТекущиеДанные.Текст);
	
КонецПроцедуры

&НаКлиенте
Функция ТекстHTML(Знач ТекстHTML)
	
	НРегТекстHTML = ТекстHTML;
	НРегТекстHTML = СтрЗаменить(НРегТекстHTML, " ", "");
	НРегТекстHTML = СтрЗаменить(НРегТекстHTML, Символы.Таб, "");
	НРегТекстHTML = СтрЗаменить(НРегТекстHTML, Символы.ВТаб, "");
	НРегТекстHTML = СтрЗаменить(НРегТекстHTML, Символы.НПП, "");
	НРегТекстHTML = СтрЗаменить(НРегТекстHTML, Символы.ПС, "");
	НРегТекстHTML = СтрЗаменить(НРегТекстHTML, Символы.ВК, "");
	НРегТекстHTML = СтрЗаменить(НРегТекстHTML, Символы.ПФ, "");
	
	Если СтрНайти(НРегТекстHTML, "<html") > 0
		ИЛИ СтрНайти(НРегТекстHTML, "</html") > 0 Тогда
		Возврат ТекстHTML;
	КонецЕсли;
	
	Если СтрНайти(НРегТекстHTML, "</p>") > 0 Тогда
		Возврат "<html>" + ТекстHTML + "</html>";
	КонецЕсли;

	Возврат "<html><p>" + ТекстHTML + "</p></html>";

КонецФункции
